[{"title":"基于github与hexo搭建自己的博客","date":"2017-02-10T09:58:05.000Z","path":"2017/02/10/基于github与hexo搭建自己的博客/","text":"本文将介绍如何基于github与hexo模板搭建一个属于自己的博客，博客的样式可以参看 李元庆的博客 博客的具体代码可以查看我的github仓库（持续更新中），同时欢迎各位留言提问与给出建议 为何选择github与hexo github为我们提供了免费的域名与仓库，相比较博客园与新浪微博等博客，虽然他们开通相对容易，但是限制较多，github Pages可以定制自己的博客内容功能能，一切有自己操控。 Github Pages优点： 轻量级的博客系统，没有麻烦的配置 使用标记语言，比如Markdown 无需自己搭建服务器 根据Github的限制，对应的每个站有300MB空间 可以绑定自己的域名Github Pages缺点： 不能关联数据库，所有的东西都是静态的 具有大小限制（似乎是2G）,不过用于搭建自己的博客或者是小站完全是够的一开始我选择的是官方推荐的Jekyll，但是Jekyll需要的环境太多，较复杂，所以后来我选择的比较简单的hexo接下来我将介绍如何搭建博客并绑定自己的域名 注册github账号和自己的仓库 前往github注册登录账号，与一般的网站注册账号的流程差不多，但是github是国外网站，在国内访问速度会有点慢注册好了之后登录&lt; 建立自己的仓库&lt; 然后点击new按钮你会看到&lt;注意你的公共哭的名称要填写格式为XXX.github.io其中XXX是你的用户名 未完待续。。。","tags":[{"name":"github 博客 hexo","slug":"github-博客-hexo","permalink":"http://liyuanqing.top/tags/github-博客-hexo/"}]},{"title":"测试博客","date":"2017-02-09T10:37:47.000Z","path":"2017/02/09/测试博客/","text":"测试标题一 这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试 这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试 这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试 这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试 这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试 这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试 这是测试测试这是测试测试这是测试测试这是测试测试 这是测试测试这是测试测试这是测试测试 这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试 这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试 这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试 这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试 这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试 这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试 这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试 这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试 这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试 这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试 这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试这是测试测试","tags":[{"name":"测试","slug":"测试","permalink":"http://liyuanqing.top/tags/测试/"}]},{"title":"Hello World","date":"2017-02-09T06:11:39.448Z","path":"2017/02/09/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]}]